[TOC]



# 继承与多态-深入掌握oop语言最强大的机制





## 1.继承的基本意义

1. 继承的本质和原理?
   继承的本质: 1.做代码复用; 2.
   类和类的关系:
   组合: a part of ...    一部分的关系
   继承: a kind of ...  一种的关系

   ```c++
   #include <iostream>
   using namespace std;
   
   class A
   {
   public:
   	int ma;
   protected:
   	int mb;
   private:
   	int mc;
   };
   // A 12字节
   
   //class B : public A //继承    A是基类/父类  B是派生类/子类
   //{
   //public:
   //	void func()
   //	{
   //		cout << "ma:" << ma << endl;
   //	}
   //	int md;
   //	int me;
   //	int mf;
   //};
   
   
   //class B : protected A //继承    A是基类/父类  B是派生类/子类
   //{
   //public:
   //	void func()
   //	{
   //		
   //	}
   //	int md;
   //	int me;
   //	int mf;
   //};
   
   class B : private A //继承    A是基类/父类  B是派生类/子类
   {
   public:
   	void func()
   	{
   
   	}
   	int md;
   	int me;
   	int mf;
   };
   
   //B有两部分, A+B本身, 24字节
   
   class C : public B //继承    A是基类/父类  B是派生类/子类
   {
   public:
   	void func()
   	{
   
   	}
   	int md;
   	int me;
   	int mf;
   };
   
   int main()
   {
   
   }
   ```

2. 继承的细节

   | 继承方式  | 基类的访问限定 | 派生类的访问限定         | (main)外部的访问限定   |
   | --------- | :------------- | ------------------------ | ---------------------- |
   | public    | public         | public                   | ok                     |
   |           | protected      | protected                | no(main只能访问公有的) |
   |           | private        | 不可见,无法访问,不是私有 | no                     |

       void show(int i = 20) override {
           cout << "call Derive::show---" << i << endl;
       }
   };
   
   int main() {
       Base* p = new Derive(); // 使用基类指针指向派生类对象
       p->show(); // 动态绑定，调用Derive::show, 但是输出却是 10, 不是20
       delete p; // 释放内存
       return 0;
   }
   
   //为什么会是10 呢
   从函数调用角度讲, 先压参数列表, 才压函数符号
   而在编译阶段, 看不到动态绑定, 只能看到是Base*类, 因此压入的是10
   push 0Ah   编译时
   mov eax, dword ptr[p]  运行时   
   mov ecx, deord ptr[eax]
   call eax
   
   push的是死的, 不会因为后面调虚函数而改变
       
       
   ```

2. 实例-2
   **重点:成员的权限, 是在编译阶段 确定好的!!!!!!**
   编译阶段只能看见 p是Base的, 而基类里是 public的
   千万不要去 运行时看  成员权限!!

   ```c++
   #include <iostream>
   using namespace std;
   
   class Base {
   public:
       virtual void show() {
           cout << "call Base::show i:" << endl;
       }
   
       virtual ~Base() {} // 虚析构函数
   };
   
   class Derive : public Base {
   private:
       void show() override {
           cout << "call Derive::show---"  << endl;
       }
   };
   
   int main() {
       Base* p = new Derive(); 
       p->show(); // 运行时确定
       delete p; 
       return 0;
   }
   
   
       
       
   ```

3. 实例-3
   重点: **vfptr什么时候拿到虚函数表地址?  是重点!!!**
   每个类（无论是基类还是派生类）都有自己的虚函数表（vtable）。
   每个对象（无论是基类对象还是派生类对象）都有自己的虚函数表指针（vfptr），指向其所属类的虚函数表。

   

   ```c++
   #include <iostream>
   using namespace std;
   
   class Base {
   public:
       Base() {
           /*
       push ebp
       mov ebp, esp
       sub esp, 4Ch
       rep stos esp<->ebp     0xCCCCCCCC (windows VS GCC/G++)
       此时, 就会进行  vfptr->vftable地址
       进入函数后, 第一件事就是虚函数表指针的存储
       */
           cout << "call Base()" << endl;
           clear();
       }
       void clear()
       {
           memset(this, 0, sizeof(*this));
       }
       virtual void show() {
           cout << "call Base::show()" << endl;
       }
   
       virtual ~Base() {
           cout << "call ~Base()" << endl;
       }
   };
   
   class Derive : public Base {
   public:
       Derive() {
           cout << "call Derive()" << endl;
       }
   
       void show() override {
           cout << "call Derive::show()" << endl;
       }
   
       ~Derive() {
           cout << "call ~Derive()" << endl;
       }
   };
   
   int main() { 
       //Base* pbl = new Base();   
       //pbl->show(); // 动态绑定
       //delete pbl;  //这一段肯定会出错, vfptr是0了, 肯定访问不到了
   
       Base* pb2 = new Derive();  
       pb2->show(); // 动态绑定，
       delete pb2;  // 这一段是可以的, 先基类构造, 再派生类构造
       //涉及到了  vfptr什么时候得到的vftable的 地址, 在构造函数里
       //将会把派生类虚函数地址写入vfptr, 
   
       
   
       return 0;
   }
   ```




# 继承与多态-多重继承

## 1.虚基类和虚继承

### 本节内容

1. 多重继承?
   代码复用, 一个派生类 有多个基类
   抽象类---有纯虚函数的类

2.  虚基类
   virtual的两种修饰

   1. 修饰成员方法----叫做虚函数
   2. 修饰继承方式--->虚继承. 被虚继承的类, 称为虚基类

   ```c++
   
   class A { private: int ma; };
   class B : virtual public A
   {
   private:
       int mb;
   };
   ```

   

3. 看一下虚基类的结构
   基类被虚继承后的 内存布局  如下:  多了 **vbptr 和 vbtable**, 注意区别 vfptr与vftable
   virtual base    与    virtual func

   ```c++
   class A size(4):
           +---
    0      | ma
           +---
   
   
   
   
   class B size(12):  ----  x86上
           +---
    0      | {vbptr}      -----  重点 :  指向vbtable
    4      | mb
           +---
           +--- (virtual base A)   ----  这里开始是A
    8      | ma
           +---
   
   B::$vbtable@:
    0      | 0
    1      | 8 (Bd(B+0)A)      ----- 重点, 相较于vbptr的偏移量
   
   
   ```

4. 根据这个结构, 思考下面这个例子为什么出错?

   ```c++
   #include <iostream>
   using namespace std;
   
   
   class A 
   { 
   private: 
       int ma;
   public:
       virtual void func()
       {
           cout << "call A:func" << endl;
         }
   
       //添加一个 new重载, 看看 new和delete的一不一样
       void operator delete(void* ptr)
       {
           cout << "delete p: " << ptr << endl;
           free(ptr);
   
       }
   };
   class B : virtual public A
   {
   private:
       int mb;
   public:
       void func()
       {
           cout << "call B:func" << endl;
       }
       //添加一个 new重载, 看看 new和delete的一不一样
       void* operator new(size_t size)
       {
           void* p = malloc(size);
